0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            flowRateInletVelocity;
        massFlowRate constant 0.5;
	rhoInlet	1000;
    }

    "side_wall|bottom|pipe_wall"
    {
        type            uniformFixedValue;
	uniformValue	constant (0 0 0);
	value		uniform (0 0 0);
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    inlet
    {
	//type			swirlInletVelocity;
	//axis			(0 0 1);
	//origin			(0 0 0);
	//axialVelocity		constant 0.1;
	//radialVelocity		constant 0;
	//tangentialVelocity	constant 1;
	type            swirlFlowRateInletVelocity;
        flowRate	constant 	-0.0005;
	rpm		constant	1000;
	value		uniform 	(0 0 0);
    }
}

// ***************************caesar_wiratama_2023************************** //
// ************************************************************************* //

