0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    front
    {
        type            fixedValue;
        value           uniform 1;
    }

    "side_wall|bottom|pipe_wall"
    {
        type            zeroGradient;
    }

    top
    {
        type            inletOutlet;
	inletValue	uniform 0;
        value           uniform 0;
    }
}

// ***************************caesar_wiratama_2023************************** //
// ************************************************************************* //
