constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "0.0002/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    side_wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          7550;
        startFace       425277;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3179;
        startFace       432827;
    }
    top
    {
        type            patch;
        nFaces          2142;
        startFace       436006;
    }
    front
    {
        type            patch;
        nFaces          850;
        startFace       438148;
    }
    pipe_wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3676;
        startFace       438998;
    }
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          951;
        startFace       442674;
    }
)

// ************************************************************************* //
