system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;
h 200;

vertices
(
    (-150 -150 0) //0
    (150 -150 0) //1
    (800 -150 0) //2
    (-35.3553 -35.3553 0) //3
    (35.3553 -35.3553 0) //4
    (-22 -22 0) //5
    (22 -22 0) //6
    (-22 22 0) //7
    (22 22 0) //8
    (-35.3553 35.3553 0) //9
    (35.3553 35.3553 0) //10
    (-150 150 0) //11
    (150 150 0) //12
    (800 150 0) //13
    
    (-150 -150 $h) //14
    (150 -150 $h) //15
    (800 -150 $h) //16
    (-35.3553 -35.3553 $h) //17
    (35.3553 -35.3553 $h) //18
    (-22 -22 $h) //19
    (22 -22 $h) //20
    (-22 22 $h) //21
    (22 22 $h) //22
    (-35.3553 35.3553 $h) //23
    (35.3553 35.3553 $h) //24
    (-150 150 $h) //25
    (150 150 $h) //26
    (800 150 $h) //27
    

);

edges
(
   arc 3 9 (-50 0 0)
   arc 9 10 (0 50 0)
   arc 10 4 (50 0 0)
   arc 4 3 (0 -50 0)
   
   arc 17 23 (-50 0 $h)
   arc 23 24 (0 50 $h)
   arc 24 18 (50 0 $h)
   arc 18 17 (0 -50 $h)
   
);

ri 10;
ro 20;
t 17;
z 50;
x 50;

blocks
(
    hex (0 1 4 3 14 15 18 17) ($t $ro $z) simpleGrading (1 0.333 1) //1
    hex (0 3 9 11 14 17 23 25) ($ro $t $z) simpleGrading (0.333 1 1) //2
    hex (3 5 7 9 17 19 21 23) ($ri $t $z) simpleGrading (1 1 1) //3
    hex (3 4 6 5 17 18 20 19) ($t $ri $z) simpleGrading (1 1 1) //4
    hex (5 6 8 7 19 20 22 21) ($t $t $z) simpleGrading (1 1 1) //5
    hex (6 4 10 8 20 18 24 22) ($ri $t $z) simpleGrading (1 1 1) //6
    hex (4 1 12 10 18 15 26 24) ($ro $t $z) simpleGrading (3 1 1) //7
    hex (7 8 10 9 21 22 24 23) ($t $ri $z) simpleGrading (1 1 1) //8
    hex (9 10 12 11 23 24 26 25) ($t $ro $z) simpleGrading (1 3 1) //9
    hex (1 2 13 12 15 16 27 26) ($x $t $z) simpleGrading (1 1 1) //10
    
);

boundary
(
    side_wall
    {
        type wall;
        faces
        (   
            (2 16 15 1)
            (1 15 14 0)
            (0 14 25 11)
            (11 25 26 12)
            (12 26 27 13)

        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 4 3)
            (0 3 9 11)
            (3 5 7 9)
            (3 4 6 5)
            (5 6 8 7)
            (6 4 10 8)
            (4 1 12 10)
            (7 8 10 9)
            (9 10 12 11)
            (1 2 13 12)

        );
    }

    top
    {
        type patch;
        faces
        (
            (14 15 18 17)
	    (14 17 23 25)
	    (17 19 21 23)
	    (17 18 20 19)
	    (19 20 22 21)
	    (18 24 22 20)
	    (18 15 26 24)
	    (21 22 24 23)
	    (23 24 26 25)
	    (15 16 27 26)
       );
    }

    front
    {
        type patch;
        faces
        (
            (2 16 27 13)
        );
    }

);

// ***************************caesar_wiratama_2023************************** //
// ************************************************************************* //
